export interface PriceItem {
  name: string;
  price: string;
}

export const PRICES_SERVICE: Record<string, PriceItem[]> = {
  therapy: [
    { name: "Консультация стоматолога-терапевта", price: "1 000 ₽" },
    { name: "Лечение поверхностного кариеса", price: "от 6 000 ₽" },
    { name: "Лечение глубокого кариеса с реставрацией", price: "от 7 500 ₽" },
    { name: "Художественная реставрация зуба", price: "от 8 000 ₽" },
    {
      name: "Экстренная помощь при острой боли (диагностическое препарирование, наложение безмышьяковистой пасты на рог пульпы, наложение дентин-пасты)",
      price: "от 2 000 ₽",
    },
  ],
  orthopedics: [
    { name: "Консультация стоматолога-ортопеда", price: "1 000 ₽" },
    { name: "Винир керамический (E.max) за 1 ед.", price: "от 27 000 ₽" },
    { name: "Коронка металлокерамическая (1 ед)", price: "от 16 000₽" },
    {
      name: "Коронка диоксид-циркониевая с керамическим нанесением (1 ед),",
      price: "от 27 000₽",
    },
    {
      name: "Полный съемный акриловый протез с гарнитурными зубами ПРЕМИУМ класса (Германия)",
      price: "от 36 000₽",
    },
    {
      name: "Бюгельный протез на телескопических коронках",
      price: "от 56 000₽",
    },
  ],
  whitening: [
    {
      name: "Отбеливание зубов системой Zoom 4 (обе челюсти)",
      price: "от 40 000 ₽",
    },
    {
      name: "Клиническое отбеливание системой Opalescence Boost PF",
      price: "от 16 000 ₽",
    },
    {
      name: "Профессиональная гигиена Air Flow перед отбеливанием",
      price: "от 6 500 ₽",
    },
  ],
  implantation: [
    { name: "Консультация хирурга-имплантолога", price: "1 000 ₽" },
    { name: "Установка имплантата (премиум система)", price: "от 35 000 ₽" },
    { name: "Синус-лифтинг (костная пластика)", price: "от 20 000 ₽" },
  ],
  surgery: [
    { name: "Удаление зуба (простое)", price: "от 6 000 ₽" },
    { name: "Удаление зуба мудрости (сложное)", price: "от 8 000 ₽" },
    { name: "Пластика уздечки языка или губы", price: " от 6 000 ₽" },
  ],
  orthodontics: [
    { name: "Консультация стоматолога-ортодонта", price: "1 000 ₽" },
    { name: "Ортодонтическая диагностика ", price: "10 000 ₽" },
    {
      name: "Фиксация брекет-системы Daimon керамической (1 челюсть)",
      price: "55 000 ₽",
    },
    {
      name: "Фиксация брекет-системы Daimon металлической (1 челюсть)",
      price: "от 45 000 ₽",
    },
    {
      name: "Ортодонтическое лечение элайнерами (за 1 месяц)",
      price: "от 25 000 ₽",
    },
  ],
  planmeca: [
    { name: "3D-томография (КЛКТ) двух челюстей", price: "3 500 ₽" },
    { name: "3D-томография (КЛКТ) одного сегмента", price: "1 500 ₽" },
    { name: "3D-томография (КЛКТ) одной челюсти", price: "2 00 ₽" },
    {
      name: "Прицельный снимок одного зуба (радиовизиография)",
      price: "1200 ₽",
    },
  ],
  endodontics: [
    {
      name: "Диагностическое препарирование корневого канала",
      price: "от 2 000 ₽",
    },
    {
      name: "Инструментальная обработка корневого канала ручная (1 канал)",
      price: "от 1 000 ₽",
    },
    {
      name: "Инструментальная обработка корневого канала с помощью эндомотора (1 канал)",
      price: "1 500 ₽",
    },

    {
      name: "Пломбирование верхушки корневого канала пастой Метапекс (1 канал)",
      price: "1 000 ₽",
    },

    {
      name: "Пломбирование корневого канала гуттаперчей (1 канал)",
      price: "от 1 700 ₽",
    },

    {
      name: "Установка стекловолоконного штифта",
      price: "2 000 ₽",
    },
  ],
  hygiene: [
    {
      name: "Комплексная чистка Air Flow + ультразвук + реминерализующая терапия",
      price: "от 6 500 ₽",
    },
    { name: "Снятие минерализованных зубных отложений УЗ-скейлером, обе челюсти", price: "4 000 ₽" },
    { name: "Обучение гигиене полости рта и подбор ухода", price: "1000" },
  ],
};
